tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

cask_args appdir: "/Applications"

brew "mas"

# Browsers
cask "safari-technology-preview"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"

# Edge Canary is not available via Homebrew
cask "microsoft-edge-dev"

# Producitivty & Utility
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825

mas "Agenda", id: 1287445660
mas "iA Writer", id: 775737590
mas "MindNode 2", id: 992076693
mas "Reeder 3", id: 880001334
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tailscale", id: 1475387142

cask "1password"
cask "1password-cli"
cask "bettertouchtool"
cask "blackhole"
cask "alfred3"
cask "anki"
cask "backblaze"
cask "basictex"
cask "beardedspice"
cask "busycal"
cask "busycontacts"
cask "camtasia"
cask "canon-captureontouch-utility"
cask "contexts"
cask "gifox"
cask "grandperspective"
cask "handbrake"
cask "keycastr"
cask "macpass"
cask "nextcloud"
cask "papers"
cask "raindropio"
cask "raycast"
cask "sim-daltonism"
cask "spotify"
cask "tidal"
cask "ubersicht"
cask "zotero"

# Messaging & Collaboration
mas "Slack", id: 803453959

cask "microsoft-teams"
cask "signal"
cask "skype"
cask "telegram"
cask "zoomus"

# Business & Taxes
mas "Steuererklärung", id: 748816884
mas "Tyme 2", id: 1063996724

cask "moneymoney"

# Design
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456

cask "figma"
cask "imageoptim"
cask "sketch"

# Some fonts are installed using Subversion
brew "svn"

cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-arimo"
cask "font-crimson-pro"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-ibm-plex"
cask "font-inter"
cask "font-inconsolata"
cask "font-jost"
cask "font-karla"
cask "font-libre-baskerville"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-metropolis"
cask "font-overpass"
cask "font-pt-sans"
cask "font-roboto"
cask "font-roboto-slab"
cask "font-pt-serif"
cask "font-space-grotesk"
cask "font-vollkorn"
cask "font-work-sans"
cask "font-yatra-one"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-space-grotesk"
cask "font-space-mono"
cask "font-spectral"

# Dev
cask "android-studio"
cask "dash3"
cask "docker"
cask "eclipse-jee"
cask "fork"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "mamp"
cask "ngrok"
cask "paw"
cask "qt-creator"
cask "phpstorm"
cask "processing"
cask "ray"
cask "rstudio"
cask "sublime-text"
cask "sublime-merge"
cask "tableplus"
cask "tower"
cask "transmit"
cask "visual-studio"
cask "visual-studio-code"
cask "vmware-fusion"

# CLI
brew "ansible"
brew "bash"
brew "brotli"
brew "caddy"
brew "cloudfoundry/tap/cf-cli@7"
brew "curl"
brew "coreutils"
brew "findutils"
brew "fish"
brew "fonttools"
brew "gcc"
brew "gnu-sed"
brew "gnu-tar"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-secrets"
brew "goaccess"
brew "imageoptim-cli"
brew "insect"
brew "libgit2"
brew "mailhog"
brew "make"
brew "npm"
brew "optipng"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
brew "pngquant"
brew "potrace"
brew "python3"
brew "qt5"
brew "r"
brew "rsync"
brew "rust"
brew "rustfmt"
brew "smartmontools"
brew "spotifyd"
brew "sqlite3"
brew "stow"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "xz"
brew "zopfli"
