cask_args appdir: "/Applications"

brew "mas"

# Browsers
cask "firefox@developer-edition"
cask "google-chrome"

# Producitivty & Utility
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825

mas "MindNode 2", id: 992076693

cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "alfred"
cask "contexts"
cask "gephi"
cask "grandperspective"
cask "macpass"
cask "mullvadvpn"
cask "netnewswire"
cask "rectangle"
cask "tyme"
cask "vlc"
cask "zotero"

# Messaging & Collaboration
cask "slack"
cask "signal"

# Business & Taxes
mas "Steuererklärung", id: 748816884

cask "moneymoney"

# Design
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456

cask "figma"
cask "imageoptim"
cask "sketch"
cask "sim-daltonism"

# Some fonts are installed using Subversion
brew "svn"

cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-arimo"
cask "font-crimson-pro"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-ibm-plex"
cask "font-inter"
cask "font-inconsolata"
cask "font-jost"
cask "font-karla"
cask "font-libre-baskerville"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-metropolis"
cask "font-overpass"
cask "font-pt-sans"
cask "font-roboto"
cask "font-roboto-slab"
cask "font-pt-serif"
cask "font-space-grotesk"
cask "font-vollkorn"
cask "font-work-sans"
cask "font-yatra-one"
cask "font-source-sans-3"
cask "font-source-serif-4"
cask "font-space-grotesk"
cask "font-space-mono"
cask "font-spectral"

# Dev
cask "dash@6"
cask "docker"
# cask "gpg-suite" # For now, install beta for Ventura manually
cask "iterm2"
cask "rapidapi"
cask "sublime-text"
cask "sublime-merge"
cask "tableplus"
cask "tailscale"

# CLI
brew "ansible"
brew "bash"
brew "brotli"
brew "curl"
brew "coreutils"
brew "docker-compose"
brew "findutils"
brew "fish"
brew "fonttools"
brew "gnu-sed"
brew "gnu-tar"
brew "gh"
brew "git"
brew "make"
brew "npm"
brew "pandoc"
brew "pandoc-crossref"
brew "python3"
brew "rsync"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
